Revit 2027 API
RebarShapeConstraintSegmentLength Class
 A constraint that controls the length of a segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintSegmentLength : RebarShapeConstraint
Public Class RebarShapeConstraintSegmentLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintSegmentLength : public RebarShapeConstraint
type RebarShapeConstraintSegmentLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintSegmentLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSegmentLength |  Create a segment length constraint.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetSegmentEndReferenceType |  Choice of two possibilities for the start and end references of the length constraint.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace